//
//  LJYViewController.m
//  CTTableView
//
//  Created by Daniel Liu on 14-5-26.
//  Copyright (c) 2014年 wmss. All rights reserved.
//

#import "LJYViewController.h"
#import "LJYCustomTableViewCell.h"
#import "LJYCustomAttributeString.h"

@interface LJYViewController () <UITableViewDelegate,UITableViewDataSource>
@property (weak, nonatomic) IBOutlet UITableView *tableView;
@property (strong, nonatomic) NSMutableArray *contentArr;
@property (strong, nonatomic) NSMutableArray *attrContentArr;


@end

@implementation LJYViewController

- (void)viewDidLoad
{
    [super viewDidLoad];
	// Do any additional setup after loading the view, typically from a nib.
    self.tableView.delegate = self;
    self.tableView.dataSource = self;
    [self.tableView registerClass:[LJYCustomTableViewCell class] forCellReuseIdentifier:@"Cell"];
    self.contentArr = [NSMutableArray arrayWithArray:@[
                                                       @"1我很多字...!!!",
                                                       @"2我很多字...!!!",
                                                       @"3我很多字...!!!",
                                                       @"4我很多字...!!!",
                                                       @"5我很多字...!!!",
                                                       @"6我很多字...!!!",
                                                       @"7我很多字...!!!",
                                                       @"8我很多字...!!!",
                                                       @"9我很多字...!!!",
                                                       @"10我很多字...!!!",
                                                       @"11我很多字...!!!",
                                                       @"12我很多字...!!!",
                                                       @"13我很多字...!!!",
                                                       @"14我很多字...!!!",
                                                       @"我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....",@"1我很多字...!!!",
                                                       @"2我很多字...!!!",
                                                       @"3我很多字...!!!",
                                                       @"4我很多字...!!!",
                                                       @"5我很多字...!!!",
                                                       @"6我很多字...!!!",
                                                       @"7我很多字...!!!",
                                                       @"8我很多字...!!!",
                                                       @"9我很多字...!!!",
                                                       @"10我很多字...!!!",
                                                       @"11我很多字...!!!",
                                                       @"12我很多字...!!!",
                                                       @"13我很多字...!!!",
                                                       @"14我很多字...!!!",
                                                       @"我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....",@"1我很多字...!!!",
                                                       @"2我很多字...!!!",
                                                       @"3我很多字...!!!",
                                                       @"4我很多字...!!!",
                                                       @"5我很多字...!!!",
                                                       @"6我很多字...!!!",
                                                       @"7我很多字...!!!",
                                                       @"8我很多字...!!!",
                                                       @"9我很多字...!!!",
                                                       @"10我很多字...!!!",
                                                       @"11我很多字...!!!",
                                                       @"12我很多字...!!!",
                                                       @"13我很多字...!!!",
                                                       @"14我很多字...!!!",
                                                       @"我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....",@"1我很多字...!!!",
                                                       @"2我很多字...!!!",
                                                       @"3我很多字...!!!",
                                                       @"4我很多字...!!!",
                                                       @"5我很多字...!!!",
                                                       @"6我很多字...!!!",
                                                       @"7我很多字...!!!",
                                                       @"8我很多字...!!!",
                                                       @"9我很多字...!!!",
                                                       @"10我很多字...!!!",
                                                       @"11我很多字...!!!",
                                                       @"12我很多字...!!!",
                                                       @"13我很多字...!!!",
                                                       @"14我很多字...!!!",
                                                       @"我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字....我超多字...."
                                                       ]];
}

- (void)didReceiveMemoryWarning
{
    [super didReceiveMemoryWarning];
    // Dispose of any resources that can be recreated.
}

#pragma mark - init property if not set
- (NSMutableArray *)contentArr
{
    if (!_contentArr) {
        _contentArr = [NSMutableArray array];
    }
    return _contentArr;
}
- (NSMutableArray *)attrContentArr
{
    if (!_attrContentArr) {
        _attrContentArr = [NSMutableArray array];
    }
    return _attrContentArr;
}



#pragma mark - UITableView Datasource

- (NSInteger)numberOfSectionsInTableView:(UITableView *)tableView {
    return 1;
}

- (NSInteger)tableView:(UITableView *)tableView numberOfRowsInSection:(NSInteger)section {
    return [self.contentArr count];
}

- (UITableViewCell *)tableView:(UITableView *)tableView cellForRowAtIndexPath:(NSIndexPath *)indexPath {
    static NSString *cellIdentifier = @"Cell";
    
    LJYCustomTableViewCell *cell = [tableView dequeueReusableCellWithIdentifier:cellIdentifier];
    
    cell.content = [self.contentArr objectAtIndex:indexPath.row];
//    NSLog(@"%d cell 💔 💔 💔 💔 💔 💔", indexPath.row);     // 💔 💙 💚 💛 💜 💡 💢 💣
    
    return cell;
}


#pragma mark - UITableView Delegate methods

- (CGFloat)tableView:(UITableView *)tableView heightForRowAtIndexPath:(NSIndexPath *)indexPath
{
    if ([self.contentArr count] >= indexPath.row) {
        CGRect rect = CGRectInset(self.view.bounds, 10, 10);
        
        
        LJYCustomAttributeString* aCS = [[LJYCustomAttributeString alloc] initWith:[self.contentArr objectAtIndex:indexPath.row] withWidth:rect.size.width];
        
        NSLog(@"%lf height 💔 💔 💔 💔 💔 💔", aCS.height);     // 💔 💙 💚 💛 💜 💡 💢 💣
        return aCS.height;
    }
    
    return 0;
}

- (void)tableView:(UITableView *)tableView didSelectRowAtIndexPath:(NSIndexPath *)indexPath {

}

@end
